In [2]:
import pandas as pd

In [31]:
ratings = pd.read_csv('ratings.csv')
ratings.tail()

        userId  movieId  rating   timestamp
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

In [32]:
movies = pd.read_csv('movies.csv')
movies.tail()

,movieId,title,genres
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [20]:
movies.movieId.value_counts()

57669     1
112183    1
2732      1
685       1
70293     1
         ..
81229     1
91470     1
5456      1
50514     1
82152     1
Name: movieId, Length: 9742, dtype: int64

In [18]:
movies[movies.title == 'Emma (1996)']

      movieId        title                genres
650       838  Emma (1996)  Comedy|Drama|Romance
5601    26958  Emma (1996)               Romance

In [9]:
import time
time.time()

1619321056.3558354

In [10]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [12]:
len(movies.genres.value_counts())

951

In [16]:
ratings[ratings.rating == ratings.rating.max()]

        userId  movieId  rating   timestamp
3            1       47     5.0   964983815
4            1       50     5.0   964982931
6            1      101     5.0   964980868
8            1      151     5.0   964984041
9            1      157     5.0   964984100
...        ...      ...     ...         ...
100814     610   158238     5.0  1479545219
100829     610   164179     5.0  1493845631
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352

[13211 rows x 4 columns]

In [33]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.tail()

,userId,movieId,rating,timestamp,title,genres
100831,610,166534,4.0,1493848402,Split (2017),Drama|Horror|Thriller
100832,610,168248,5.0,1493850091,John Wick: Chapter Two (2017),Action|Crime|Thriller
100833,610,168250,5.0,1494273047,Get Out (2017),Horror
100834,610,168252,5.0,1493846352,Logan (2017),Action|Sci-Fi
100835,610,170875,3.0,1493846415,The Fate of the Furious (2017),Action|Crime|Drama|Thriller

In [34]:
len(ratings)==len(joined)

True

In [50]:
ratings.merge(movies, on='movieId', how='outer').tail()

,userId,movieId,rating,timestamp,title,genres
100849,NaN,30892,NaN,NaN,In the Realms of the Unreal (2004),Animation|Documentary
100850,NaN,32160,NaN,NaN,Twentieth Century (1934),Comedy
100851,NaN,32371,NaN,NaN,Call Northside 777 (1948),Crime|Drama|Film-Noir
100852,NaN,34482,NaN,NaN,"Browning Version, The (1951)",Drama
100853,NaN,85565,NaN,NaN,Chalet Girl (2011),Comedy|Romance

In [37]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [38]:
movies.movieId.value_counts()

57669     1
112183    1
2732      1
685       1
70293     1
         ..
81229     1
91470     1
5456      1
50514     1
82152     1
Name: movieId, Length: 9742, dtype: int64

In [46]:
movies.title.value_counts()

War of the Worlds (2005)                  2
Saturn 3 (1980)                           2
Emma (1996)                               2
Eros (2004)                               2
Confessions of a Dangerous Mind (2002)    2
                                         ..
Giant (1956)                              1
Prince of Egypt, The (1998)               1
Election (1999)                           1
Panic Room (2002)                         1
Jane Eyre (1944)                          1
Name: title, Length: 9737, dtype: int64

In [53]:
ratings_small = pd.read_csv('ratings_example.txt',sep='\t')
ratings_small.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [70]:
movies_small = pd.read_csv('movies_example.txt',sep='\t')
movies_small.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [77]:
#movies_small['genres'][2]='Comedy|Drama'
movies_small.loc[2,'genres'] = 'Comedy|Drama'
movies_small.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)              Comedy|Drama

In [78]:
result = ratings_small.merge(movies_small,on='movieId',how='inner')
result.drop_duplicates(inplace=True)
result

   userId  movieId  rating   timestamp                    title        genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)          Drama
1       1       31     2.5  1260759144  Dangerous Minds (1995)   Comedy|Drama

In [79]:
movies_small.drop_duplicates(subset='movieId',inplace=True,keep='last')
movies_small.head()

   movieId                                      title                   genres
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)              Comedy|Drama

In [80]:
result2 = ratings_small.merge(movies_small,on='movieId',how='left')
result2

   userId  movieId  rating   timestamp                    title        genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Comedy|Drama

In [82]:
items_dict = {
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 
    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],
    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]
}

purchase_log = {
    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],
    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 
    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]
}

items_df = pd.DataFrame(items_dict)
purchase_df = pd.DataFrame(purchase_log)
display(items_df,purchase_df)

   item_id   vendor  stock_count
0   417283  Samsung           54
1   849734       LG           33
2   132223    Apple          122
3   573943    Apple           18
4    19475       LG          102
5  3294095    Apple           43
6   382043  Samsung           77
7   302948  Samsung          143
8   100132       LG           60
9   312394      ZTE           19

   purchase_id  item_id  price
0          101   417283  13900
1          101   849734   5330
2          101   132223  38200
3          112   573943  49990
4          121    19475   9890
5          145  3294095  33000
6          145   382043  67500
7          145   302948  34500
8          145   103845  89900
9          221   100132  11400

In [83]:
common_df = items_df.merge(purchase_df,on='item_id',how='outer')
common_df

    item_id   vendor  stock_count  purchase_id    price
0    417283  Samsung         54.0        101.0  13900.0
1    849734       LG         33.0        101.0   5330.0
2    132223    Apple        122.0        101.0  38200.0
3    573943    Apple         18.0        112.0  49990.0
4     19475       LG        102.0        121.0   9890.0
5   3294095    Apple         43.0        145.0  33000.0
6    382043  Samsung         77.0        145.0  67500.0
7    302948  Samsung        143.0        145.0  34500.0
8    100132       LG         60.0        221.0  11400.0
9    312394      ZTE         19.0          NaN      NaN
10   103845      NaN          NaN        145.0  89900.0

In [85]:
purchase_df.merge(items_df,on='item_id',how='outer')

    purchase_id  item_id    price   vendor  stock_count
0         101.0   417283  13900.0  Samsung         54.0
1         101.0   849734   5330.0       LG         33.0
2         101.0   132223  38200.0    Apple        122.0
3         112.0   573943  49990.0    Apple         18.0
4         121.0    19475   9890.0       LG        102.0
5         145.0  3294095  33000.0    Apple         43.0
6         145.0   382043  67500.0  Samsung         77.0
7         145.0   302948  34500.0  Samsung        143.0
8         145.0   103845  89900.0      NaN          NaN
9         221.0   100132  11400.0       LG         60.0
10          NaN   312394      NaN      ZTE         19.0

In [91]:
merged = items_df.merge(purchase_df,on='item_id',how='inner')
#len(merged.item_id.value_counts())
merged

   item_id   vendor  stock_count  purchase_id  price
0   417283  Samsung           54          101  13900
1   849734       LG           33          101   5330
2   132223    Apple          122          101  38200
3   573943    Apple           18          112  49990
4    19475       LG          102          121   9890
5  3294095    Apple           43          145  33000
6   382043  Samsung           77          145  67500
7   302948  Samsung          143          145  34500
8   100132       LG           60          221  11400

In [93]:
merged['proceeds']=merged['stock_count']*merged['price']
merged

   item_id   vendor  stock_count  purchase_id  price  proceeds
0   417283  Samsung           54          101  13900    750600
1   849734       LG           33          101   5330    175890
2   132223    Apple          122          101  38200   4660400
3   573943    Apple           18          112  49990    899820
4    19475       LG          102          121   9890   1008780
5  3294095    Apple           43          145  33000   1419000
6   382043  Samsung           77          145  67500   5197500
7   302948  Samsung          143          145  34500   4933500
8   100132       LG           60          221  11400    684000

In [94]:
merged[merged.proceeds==merged.proceeds.max()].item_id

6    382043
Name: item_id, dtype: int64

In [95]:
merged.proceeds.sum()

19729490

In [96]:
import os

In [104]:
files = os.listdir('data')
files

['ratings_1.txt',
 'ratings_10.txt',
 'ratings_2.txt',
 'ratings_3.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_6.txt',
 'ratings_7.txt',
 'ratings_8.txt',
 'ratings_9.txt']

In [99]:
files = ['setup.py', 'ratings.txt', 'stock_stats.txt', 'movies.txt', 'run.sh', 'game_of_thrones.mov']

In [101]:
data = [file for file in files if 'txt' in file]
data

['ratings.txt', 'stock_stats.txt', 'movies.txt']

In [103]:
for root, dirs, files in os.walk('data'):
    print(root,dirs,files)

data ['subfolder'] ['ratings_1.txt', 'ratings_10.txt', 'ratings_2.txt', 'ratings_3.txt', 'ratings_4.txt', 'ratings_5.txt', 'ratings_6.txt', 'ratings_7.txt', 'ratings_8.txt', 'ratings_9.txt']
data\subfolder [] ['file_in_subfolder.txt']

In [110]:
os.path.dirname('data')

''

In [111]:
data = pd.DataFrame(columns=['userId','movieId','rating','timestamp'])

In [113]:
for file in files:
    temp = pd.read_csv(os.path.join('data',file), names = ['userId','movieId','rating','timestamp'])
    data=pd.concat([data,temp])
data.tail()

     userId movieId  rating  timestamp
9995    597    2572     3.0  940707828
9996    597    2613     3.0  940707355
9997    597    2657     4.0  940707124
9998    597    2661     4.0  940707609
9999    597    2662     3.0  940707473

In [114]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100004 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100004 non-null  object
 1   movieId    100004 non-null  object
 2   rating     100004 non-null  float64
 3   timestamp  100004 non-null  object
dtypes: float64(1), object(3)
memory usage: 3.8+ MB

In [117]:
len(ratings[ratings.rating==0.5])

1370

In [118]:
result = ratings.merge(movies,on='movieId',how='outer')
len(result)

100854

In [119]:
result[result.movieId==3456]

,userId,movieId,rating,timestamp,title,genres
100839,NaN,3456,NaN,NaN,"Color of Paradise, The (Rang-e khoda) (1999)",Drama